NETFLIX PROJECT

# Getting the API

In [24]:
import requests
import pandas as pd

In [25]:
# getting the information from the url
url = 'http://www.omdbapi.com/?i=tt3896198&apikey=ef5507df'
response = requests.get(url).json()
response

{'Title': 'Guardians of the Galaxy Vol. 2',
 'Year': '2017',
 'Rated': 'PG-13',
 'Released': '05 May 2017',
 'Runtime': '136 min',
 'Genre': 'Action, Adventure, Comedy',
 'Director': 'James Gunn',
 'Writer': 'James Gunn, Dan Abnett, Andy Lanning',
 'Actors': 'Chris Pratt, Zoe Saldana, Dave Bautista',
 'Plot': "The Guardians struggle to keep together as a team while dealing with their personal family issues, notably Star-Lord's encounter with his father the ambitious celestial being Ego.",
 'Language': 'English',
 'Country': 'United States',
 'Awards': 'Nominated for 1 Oscar. 15 wins & 58 nominations total',
 'Poster': 'https://m.media-amazon.com/images/M/MV5BNjM0NTc0NzItM2FlYS00YzEwLWE0YmUtNTA2ZWIzODc2OTgxXkEyXkFqcGdeQXVyNTgwNzIyNzg@._V1_SX300.jpg',
 'Ratings': [{'Source': 'Internet Movie Database', 'Value': '7.6/10'},
  {'Source': 'Rotten Tomatoes', 'Value': '85%'},
  {'Source': 'Metacritic', 'Value': '67/100'}],
 'Metascore': '67',
 'imdbRating': '7.6',
 'imdbVotes': '589,440',
 'imdbID': 'tt3896198',
 'Type': 'movie',
 'DVD': '10 Jul 2017',
 'BoxOffice': '$389,813,101',
 'Production': 'Walt Disney Pictures, Marvel Studios',
 'Website': 'N/A',
 'Response': 'True'}

In [26]:
response.keys()

dict_keys(['Title', 'Year', 'Rated', 'Released', 'Runtime', 'Genre', 'Director', 'Writer', 'Actors', 'Plot', 'Language', 'Country', 'Awards', 'Poster', 'Ratings', 'Metascore', 'imdbRating', 'imdbVotes', 'imdbID', 'Type', 'DVD', 'BoxOffice', 'Production', 'Website', 'Response'])

In [27]:
# creating a function which returns all movie info from Title as an input 

def movie_info_x(Title):
    url = f'http://www.omdbapi.com/?t={Title}&apikey=ef5507df'
    response = requests.get(url).json()
    return response 
    
movie_info_x("The Mask")

{'Title': 'The Mask',
 'Year': '1994',
 'Rated': 'PG-13',
 'Released': '29 Jul 1994',
 'Runtime': '101 min',
 'Genre': 'Action, Comedy, Crime, Fantasy',
 'Director': 'Chuck Russell',
 'Writer': 'Michael Fallon (story), Mark Verheiden (story), Mike Werb (screenplay)',
 'Actors': 'Jim Carrey, Peter Riegert, Peter Greene, Amy Yasbeck',
 'Plot': 'Bank clerk Stanley Ipkiss is transformed into a manic superhero when he wears a mysterious mask.',
 'Language': 'English, Swedish',
 'Country': 'USA',
 'Awards': 'Nominated for 1 Oscar. Another 6 wins & 20 nominations.',
 'Poster': 'https://m.media-amazon.com/images/M/MV5BOWExYjI5MzktNTRhNi00Nzg2LThkZmQtYWVkYjRlYWI2MDQ4XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg',
 'Ratings': [{'Source': 'Internet Movie Database', 'Value': '6.9/10'},
  {'Source': 'Rotten Tomatoes', 'Value': '79%'},
  {'Source': 'Metacritic', 'Value': '56/100'}],
 'Metascore': '56',
 'imdbRating': '6.9',
 'imdbVotes': '353,410',
 'imdbID': 'tt0110475',
 'Type': 'movie',
 'DVD': '01 Jun 2009',
 'BoxOffice': '$119,938,730',
 'Production': 'New Line Cinema, Dark Horse Entertainment',
 'Website': 'N/A',
 'Response': 'True'}

# Personalising the API response

In [28]:
# to show the ratings from Rotten Tomatoes and from Metacritics as additional columns

In [29]:
Title = "The Mask"
url = f'http://www.omdbapi.com/?t={Title}&apikey=ef5507df'
response = requests.get(url).json()
ratings_list = response["Ratings"]
for i in range(1, len(ratings_list)):
    response[ratings_list[i]['Source']] = ratings_list[i]['Value']

In [30]:
response

{'Title': 'The Mask',
 'Year': '1994',
 'Rated': 'PG-13',
 'Released': '29 Jul 1994',
 'Runtime': '101 min',
 'Genre': 'Action, Comedy, Crime, Fantasy',
 'Director': 'Chuck Russell',
 'Writer': 'Michael Fallon (story), Mark Verheiden (story), Mike Werb (screenplay)',
 'Actors': 'Jim Carrey, Peter Riegert, Peter Greene, Amy Yasbeck',
 'Plot': 'Bank clerk Stanley Ipkiss is transformed into a manic superhero when he wears a mysterious mask.',
 'Language': 'English, Swedish',
 'Country': 'USA',
 'Awards': 'Nominated for 1 Oscar. Another 6 wins & 20 nominations.',
 'Poster': 'https://m.media-amazon.com/images/M/MV5BOWExYjI5MzktNTRhNi00Nzg2LThkZmQtYWVkYjRlYWI2MDQ4XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SX300.jpg',
 'Ratings': [{'Source': 'Internet Movie Database', 'Value': '6.9/10'},
  {'Source': 'Rotten Tomatoes', 'Value': '79%'},
  {'Source': 'Metacritic', 'Value': '56/100'}],
 'Metascore': '56',
 'imdbRating': '6.9',
 'imdbVotes': '353,410',
 'imdbID': 'tt0110475',
 'Type': 'movie',
 'DVD': '01 Jun 2009',
 'BoxOffice': '$119,938,730',
 'Production': 'New Line Cinema, Dark Horse Entertainment',
 'Website': 'N/A',
 'Response': 'True',
 'Rotten Tomatoes': '79%',
 'Metacritic': '56/100'}

In [31]:
# updating the function to includ the above 2 additional columns & dropping the original Ratings dictionary 

def movie_info_(Title):
    url = f'http://www.omdbapi.com/?t={Title}&apikey=ef5507df'
    response = requests.get(url).json()
    ratings_list = response["Ratings"]
    for i in range(1, len(ratings_list)):
         response[ratings_list[i]['Source']] = ratings_list[i]['Value']
    del response["Ratings"]
    return response

In [32]:
movie_info_("Titanic")

{'Title': 'Titanic',
 'Year': '1997',
 'Rated': 'PG-13',
 'Released': '19 Dec 1997',
 'Runtime': '194 min',
 'Genre': 'Drama, Romance',
 'Director': 'James Cameron',
 'Writer': 'James Cameron',
 'Actors': 'Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates',
 'Plot': 'A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.',
 'Language': 'English, Swedish, Italian, French',
 'Country': 'USA, Mexico, Australia, Canada',
 'Awards': 'Won 11 Oscars. Another 115 wins & 83 nominations.',
 'Poster': 'https://m.media-amazon.com/images/M/MV5BMDdmZGU3NDQtY2E5My00ZTliLWIzOTUtMTY4ZGI1YjdiNjk3XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SX300.jpg',
 'Metascore': '75',
 'imdbRating': '7.8',
 'imdbVotes': '1,067,012',
 'imdbID': 'tt0120338',
 'Type': 'movie',
 'DVD': '01 Jun 2014',
 'BoxOffice': '$659,363,944',
 'Production': '20th Century Fox, Lightstorm Entertainment, Paramount Pictures',
 'Website': 'N/A',
 'Response': 'True',
 'Rotten Tomatoes': '89%',
 'Metacritic': '75/100'}

# Updating the movie_info function to take our df as input

In [33]:
def movie_info_imdb(df):
    movies = []
    for index , row in df.iterrows():
        title = row["Name"] #checked the exact name of column
        url = f'http://www.omdbapi.com/?t={title}&apikey=ef5507df'
        response = requests.get(url).json()
        ratings_list = response.get("Ratings")
        if ratings_list:
            for i in range(1, len(ratings_list)):
                response[ratings_list[i]['Source']] = ratings_list[i]['Value']
            del response['Ratings']
        movies.append(response)
    return pd.DataFrame(movies)

In [36]:
data_imdb_small = movie_info_imdb(data_netflix_small)

In [15]:
pd.DataFrame([movie_info_("Titanic")])

,Title,Year,Rated,Released,Runtime,Genre,Director,Writer,Actors,Plot,...,imdbVotes,imdbID,Type,DVD,BoxOffice,Production,Website,Response,Rotten Tomatoes,Metacritic
0,Titanic,1997,PG-13,19 Dec 1997,194 min,"Drama, Romance",James Cameron,James Cameron,"Leonardo DiCaprio, Kate Winslet, Billy Zane, K...",A seventeen-year-old aristocrat falls in love ...,...,"1,067,012",tt0120338,movie,01 Jun 2014,"$659,363,944","20th Century Fox, Lightstorm Entertainment, Pa...",N/A,True,89%,75/100

In [42]:
data_netflix = pd.read_csv("../raw_data/data.csv")
data_netflix

,movie_id,Year,Name,mean,count
0,1,2003.0,Dinosaur Planet,3.749543,547
1,2,2004.0,Isle of Man TT 2004 Review,3.558621,145
2,3,1997.0,Character,3.641153,2012
3,4,1994.0,Paula Abdul's Get Up & Dance,2.739437,142
4,5,2004.0,The Rise and Fall of ECW,3.919298,1140
...,...,...,...,...,...
17765,17766,2002.0,Where the Wild Things Are and Other Maurice Se...,3.193388,605
17766,17767,2004.0,Fidel Castro: American Experience,3.671569,204
17767,17768,2000.0,Epoch,2.839207,1362
17768,17769,2003.0,The Company,2.498592,6749
17769,17770,2003.0,Alien Hunter,2.816504,921

In [17]:
data_netflix_small = data_netflix.head()
data_netflix_small

   movie_id    Year                          Name      mean  count
0         1  2003.0               Dinosaur Planet  3.749543    547
1         2  2004.0    Isle of Man TT 2004 Review  3.558621    145
2         3  1997.0                     Character  3.641153   2012
3         4  1994.0  Paula Abdul's Get Up & Dance  2.739437    142
4         5  2004.0      The Rise and Fall of ECW  3.919298   1140

In [ ]:
data_imdb_small
data_netflix_small

In [37]:
data_netflix_small.merge(data_imdb_small,left_on="Name",right_on = "Title")

,movie_id,Year_x,Name,mean,count,Title,Year_y,Rated,Released,Runtime,...,imdbID,Type,totalSeasons,Response,Error,DVD,BoxOffice,Production,Website,Rotten Tomatoes
0,1,2003.0,Dinosaur Planet,3.749543,547,Dinosaur Planet,2003–,N/A,14 Dec 2003,50 min,...,tt0389605,series,N/A,True,NaN,NaN,NaN,NaN,NaN,NaN
1,3,1997.0,Character,3.641153,2012,Character,1997,R,27 Mar 1998,122 min,...,tt0119448,movie,NaN,True,NaN,04 Feb 2003,"$623,983",Almerica Film,N/A,92%

# use the merge with medium size

In [44]:
data_netflix
data_imdb = movie_info_imdb(data_netflix)
data_netflix.merge(data_imdb,left_on="Name",right_on = "Title")

,movie_id,Year_x,Name,mean,count,Title,Year_y,Rated,Released,Runtime,...,totalSeasons,Response,Error,DVD,BoxOffice,Production,Website,Rotten Tomatoes,Metacritic,Ratings
0,1,2003.0,Dinosaur Planet,3.749543,547,Dinosaur Planet,2003–,N/A,14 Dec 2003,50 min,...,N/A,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,3,1997.0,Character,3.641153,2012,Character,1997,R,27 Mar 1998,122 min,...,NaN,True,NaN,04 Feb 2003,"$623,983",Almerica Film,N/A,92%,NaN,NaN
2,6,1997.0,Sick,3.084396,1019,Sick,1997,Not Rated,07 Nov 1997,90 min,...,NaN,True,NaN,15 Feb 2017,"$116,806",Sick-the Life and Death of Bob Flanagan-Superm...,N/A,91%,82/100,NaN
3,7,1992.0,8 Man,2.129032,93,8 Man,1992,N/A,N/A,83 min,...,NaN,True,NaN,N/A,N/A,N/A,N/A,NaN,NaN,NaN
4,10,2001.0,Fighter,3.180723,249,Fighter,2007,N/A,14 Dec 2007,100 min,...,NaN,True,NaN,N/A,N/A,First Run Features,N/A,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12375,17763,1978.0,Interiors,3.411855,1957,Interiors,1978,PG,06 Oct 1978,92 min,...,NaN,True,NaN,02 Feb 2017,"$10,432,366",Rollins-Joffe Productions,N/A,79%,67/100,NaN
12376,17764,1998.0,Shakespeare in Love,3.867112,64957,Shakespeare in Love,1998,R,08 Jan 1999,123 min,...,NaN,True,NaN,21 Apr 2016,"$100,317,794","Miramax Films, Bedford Falls Productions, Univ...",N/A,92%,87/100,NaN
12377,17768,2000.0,Epoch,2.839207,1362,Epoch,2001,PG-13,24 Nov 2001,96 min,...,NaN,True,NaN,25 Jan 2017,N/A,Metro-Goldwyn-Mayer,N/A,16%,NaN,NaN
12378,17769,2003.0,The Company,2.498592,6749,The Company,2003,PG-13,20 May 2004,112 min,...,NaN,True,NaN,16 Apr 2012,"$2,283,914","First Snow Production, Capitol Films, Sandcast...",N/A,72%,73/100,NaN
12379,17770,2003.0,Alien Hunter,2.816504,921,Alien Hunter,2003,R,19 Jul 2003,92 min,...,NaN,True,NaN,20 Apr 2013,N/A,N/A,N/A,16%,NaN,NaN

In [45]:
full_data_merged = data_netflix.merge(data_imdb,left_on="Name",right_on = "Title")

In [47]:
full_data_merged.to_csv("../raw_data/full_data_merged.csv",index = False)

In [54]:
full_data_merged["Rotten Tomatoes"].apply(lambda x : x.replace("%","") if type(x)==str else x)

      Rotten Tomatoes
0                 NaN
1                 92%
2                 91%
3                 NaN
4                 NaN
...               ...
12375             79%
12376             92%
12377             16%
12378             72%
12379             16%

[12380 rows x 1 columns]